var searchData=
[
  ['обычный_20поток_20процесс_0',['завершить поток операционной системы OS/IDLE (номер слота 1), можно завершить любой обычный поток/процесс',['../namespace_kolibri_lib_1_1_thread.html#Нельзя',1,'']]],
  ['окне_1',['всё что было нарисованно в окне',['../namespace_kolibri_lib_1_1window.html#Стирает',1,'']]],
  ['операционной_20системы_20os_20idle_20номер_20слота_201_20можно_20завершить_20любой_20обычный_20поток_20процесс_2',['завершить поток операционной системы OS/IDLE (номер слота 1), можно завершить любой обычный поток/процесс',['../namespace_kolibri_lib_1_1_thread.html#Нельзя',1,'']]]
];
