var searchData=
[
  ['завершить_20поток_20операционной_20системы_20os_20idle_20номер_20слота_201_20можно_20завершить_20любой_20обычный_20поток_20процесс_0',['завершить поток операционной системы OS/IDLE (номер слота 1), можно завершить любой обычный поток/процесс',['../namespace_kolibri_lib_1_1_thread.html#Нельзя',1,'']]],
  ['заморачиваяся_20и_20вызывай_20в_20начале_20программы_1',['не заморачиваяся, и вызывай в начале программы',['../namespace_kolibri_lib.html#Просто',1,'']]],
  ['занять_20другая_20кнопка_2',['необходимо для того чтобы функция render не пыталась создать кнопку, так как в неактивном состоянии #_id освобождается и его может занять другая кнопка',['../class_kolibri_lib_1_1_u_i_1_1buttons_1_1_button.html#Занчение',1,'']]],
  ['знаю_3',['нужно выделять памяти для стека потока? Я не знаю',['../namespace_kolibri_lib_1_1_thread.html#Сколько',1,'']]]
];
