var searchData=
[
  ['элементов_20с_20номером_20больше_20i_20нужно_20увеличить_20на_201_0',['i = -1, то элемент вставляется в конец, иначе вставляется на место под номером i. При этом номера всех элементов с номером больше i, нужно увеличить на 1.',['../struct_kolibri_lib_1_1point.html#Если',1,'']]],
  ['элемент_20вставляется_20в_20конец_20иначе_20вставляется_20на_20место_20под_20номером_20i_20при_20этом_20номера_20всех_20элементов_20с_20номером_20больше_20i_20нужно_20увеличить_20на_201_1',['i = -1, то элемент вставляется в конец, иначе вставляется на место под номером i. При этом номера всех элементов с номером больше i, нужно увеличить на 1.',['../struct_kolibri_lib_1_1point.html#Если',1,'']]],
  ['эмулирует_20нажатие_20правой_20и_20левой_20кнопок_20мыши_2',[': EmulateMouse(EmulateMouse::LeftButton + EmulateMouse::RightButton) //Эмулирует нажатие правой и левой кнопок мыши',['../namespace_kolibri_lib_1_1mouse.html#Использование',1,'']]],
  ['эта_20кнопка_20нажата_20иначе_20false_3',['переменную @link _status в true если эта кнопка нажата, иначе false',['../class_kolibri_lib_1_1_u_i_1_1buttons_1_1_button.html#устанавливает',1,'']]],
  ['этом_20не_20изменяется_4',['растянуть/сжать выводимое изображение введя новые размеры в переменную size, само изображение при этом не изменяется',['../class_kolibri_lib_1_1_u_i_1_1_images_1_1_image.html#Можно',1,'']]],
  ['этом_20номера_20всех_20элементов_20с_20номером_20больше_20i_20нужно_20увеличить_20на_201_5',['i = -1, то элемент вставляется в конец, иначе вставляется на место под номером i. При этом номера всех элементов с номером больше i, нужно увеличить на 1.',['../struct_kolibri_lib_1_1point.html#Если',1,'']]],
  ['это_20всратая_20библиотека_6',['Это всратая библиотека',['../index.html',1,'']]],
  ['это_20квадрат_7',['рисуется по detalization линий. Да-да если Детализация = 4, то круг это квадрат.',['../graphic_8hpp.html#Круг',1,'']]],
  ['это_20становится_20действительно_20важно_20когда_20у_20вас_20объявленно_20более_202000_20кнопок_8',['функция может выполнятся очень долго, если вы уже создали довольно много кнопок. Это становится действительно важно когда у вас объявленно более 2000 кнопок',['../namespace_kolibri_lib_1_1_u_i_1_1buttons.html#Эта',1,'']]]
];
