var searchData=
[
  ['чтобы_20кнопка_20работала_0',['функцию нужно вызывать в цикле, чтобы кнопка работала',['../class_kolibri_lib_1_1_u_i_1_1buttons_1_1_button.html#Эту',1,'']]],
  ['чтобы_20функция_20render_20не_20пыталась_20создать_20кнопку_20так_20как_20в_20неактивном_20состоянии_20_5fid_20освобождается_20и_20его_20может_20занять_20другая_20кнопка_1',['необходимо для того чтобы функция render не пыталась создать кнопку, так как в неактивном состоянии #_id освобождается и его может занять другая кнопка',['../class_kolibri_lib_1_1_u_i_1_1buttons_1_1_button.html#Занчение',1,'']]],
  ['что_20было_20нарисованно_20в_20окне_2',['всё что было нарисованно в окне',['../class_kolibri_lib_1_1window_1_1_window.html#Стирает',1,'']]],
  ['что_20пользователь_20нажал_20кнопку_20x_3',['что пользователь нажал кнопку X',['../F:/KolibriOs/KolibriOS-Cpp-Lib/include/kolibriLib/system/os.hpp#Означает',1,'']]],
  ['что_20так_20мало_20языков_20поддерживается_4',['жаль что так мало языков поддерживается...',['../namespace_kolibri_lib_1_1_o_s.html#PS',1,'']]]
];
