var searchData=
[
  ['важно_20когда_20у_20вас_20объявленно_20более_202000_20кнопок_0',['функция может выполнятся очень долго, если вы уже создали довольно много кнопок. Это становится действительно важно когда у вас объявленно более 2000 кнопок',['../_u_i_8hpp.html#Эта',1,'']]],
  ['вас_20объявленно_20более_202000_20кнопок_1',['функция может выполнятся очень долго, если вы уже создали довольно много кнопок. Это становится действительно важно когда у вас объявленно более 2000 кнопок',['../_u_i_8hpp.html#Эта',1,'']]],
  ['возвращает_20кнопку_20в_20рабочее_20состояние_20br_2',['функции @link Deactivate, возвращает кнопку в рабочее состояние  &lt;br&gt;',['../class_kolibri_lib_1_1_u_i_1_1buttons_1_1_button.html#Противоположна',1,'']]],
  ['всё_20что_20было_20нарисованно_20в_20окне_3',['всё что было нарисованно в окне',['../class_kolibri_lib_1_1window_1_1_window.html#Стирает',1,'']]],
  ['выдаваемый_20системой_4',['кнопки выдаваемый системой',['../_u_i_8hpp.html#id',1,'']]],
  ['вызвана_20функция_20endredraw_5',['после должна быть вызвана функция #EndRedraw()',['../class_kolibri_lib_1_1window_1_1_window.html#Обязательно',1,'']]],
  ['выполнятся_20очень_20долго_20если_20вы_20уже_20создали_20довольно_20много_20кнопок_20это_20становится_20действительно_20важно_20когда_20у_20вас_20объявленно_20более_202000_20кнопок_6',['функция может выполнятся очень долго, если вы уже создали довольно много кнопок. Это становится действительно важно когда у вас объявленно более 2000 кнопок',['../_u_i_8hpp.html#Эта',1,'']]],
  ['вы_20уже_20создали_20довольно_20много_20кнопок_20это_20становится_20действительно_20важно_20когда_20у_20вас_20объявленно_20более_202000_20кнопок_7',['функция может выполнятся очень долго, если вы уже создали довольно много кнопок. Это становится действительно важно когда у вас объявленно более 2000 кнопок',['../_u_i_8hpp.html#Эта',1,'']]],
  ['в_20неактивном_20состоянии_20_5fid_20освобождается_20и_20его_20может_20занять_20другая_20кнопка_8',['необходимо для того чтобы функция render не пыталась создать кнопку, так как в неактивном состоянии #_id освобождается и его может занять другая кнопка',['../class_kolibri_lib_1_1_u_i_1_1buttons_1_1_button.html#Занчение',1,'']]],
  ['в_20окне_9',['всё что было нарисованно в окне',['../class_kolibri_lib_1_1window_1_1_window.html#Стирает',1,'']]],
  ['в_20рабочее_20состояние_20br_10',['функции @link Deactivate, возвращает кнопку в рабочее состояние  &lt;br&gt;',['../class_kolibri_lib_1_1_u_i_1_1buttons_1_1_button.html#Противоположна',1,'']]],
  ['в_20true_20если_20эта_20кнопка_20нажата_20иначе_20false_11',['переменную #_status в true если эта кнопка нажата, иначе false',['../class_kolibri_lib_1_1_u_i_1_1buttons_1_1_button.html#устанавливает',1,'']]]
];
