var searchData=
[
  ['кнопок_20это_20становится_20действительно_20важно_20когда_20у_20вас_20объявленно_20более_202000_20кнопок_0',['функция может выполнятся очень долго, если вы уже создали довольно много кнопок. Это становится действительно важно когда у вас объявленно более 2000 кнопок',['../_u_i_8hpp.html#Эта',1,'']]],
  ['когда_20у_20вас_20объявленно_20более_202000_20кнопок_1',['функция может выполнятся очень долго, если вы уже создали довольно много кнопок. Это становится действительно важно когда у вас объявленно более 2000 кнопок',['../_u_i_8hpp.html#Эта',1,'']]]
];
