var searchData=
[
  ['аналог_20стандартной_20библиотеки_20filesystem_20br_0',['пространство имён этакий аналог стандартной библиотеки &lt;filesystem&gt;  &lt;br&gt;',['../namespace_kolibri_lib_1_1filesystem.html#Это',1,'']]],
  ['а_20её_20link_20_5fid_20становится_20не_20действительным_1',['Деактивированном состоянии кнопка &quot;Не нажимается&quot;, а её @link _id становится не действительным',['../class_kolibri_lib_1_1_u_i_1_1buttons_1_1_button.html#В',1,'']]],
  ['а_20лишь_20жалкие_20пародии_20совподающие_20с_20настоящими_20лишь_20по_20размерам_20ширина_20высота_2',['самом деле это не настоящие шрифты, а лишь жалкие пародии, совподающие с настоящими лишь по размерам(ширина/высота)',['../namespace_kolibri_lib_1_1_u_i_1_1text_1_1_fonts.html#На',1,'']]],
  ['а_20не_20эту_20функцию_20а_20то_20я_20вот_20вообще_20незнаю_20сколько_20размер_20стека_20сделать_3',['лучше std::thread, а не эту функцию, а то я вот вообще незнаю сколько размер стека сделать',['../namespace_kolibri_lib_1_1_thread.html#Используйте',1,'']]]
];
