var searchData=
[
  ['так_20как_20в_20неактивном_20состоянии_20_5fid_20освобождается_20и_20его_20может_20занять_20другая_20кнопка_0',['необходимо для того чтобы функция render не пыталась создать кнопку, так как в неактивном состоянии #_id освобождается и его может занять другая кнопка',['../class_kolibri_lib_1_1_u_i_1_1buttons_1_1_button.html#Занчение',1,'']]],
  ['текущем_20потоке_1',['слот -1 то возвращается информация о текущем потоке',['../namespace_kolibri_lib_1_1_thread.html#если',1,'']]],
  ['тех_20кто_20знает_3a_20br_2',['тех кто знает:  &lt;br&gt;',['../class_kolibri_lib_1_1window_1_1_window.html#Для',1,'']]],
  ['того_20чтобы_20функция_20render_20не_20пыталась_20создать_20кнопку_20так_20как_20в_20неактивном_20состоянии_20_5fid_20освобождается_20и_20его_20может_20занять_20другая_20кнопка_3',['необходимо для того чтобы функция render не пыталась создать кнопку, так как в неактивном состоянии #_id освобождается и его может занять другая кнопка',['../class_kolibri_lib_1_1_u_i_1_1buttons_1_1_button.html#Занчение',1,'']]],
  ['то_20возвращается_20информация_20о_20текущем_20потоке_4',['слот -1 то возвращается информация о текущем потоке',['../namespace_kolibri_lib_1_1_thread.html#если',1,'']]],
  ['то_20круг_20это_20квадрат_5',['рисуется по detalization линий. Да-да если Детализация = 4, то круг это квадрат.',['../graphic_8hpp.html#Круг',1,'']]],
  ['то_20элемент_20вставляется_20в_20конец_20иначе_20вставляется_20на_20место_20под_20номером_20i_20при_20этом_20номера_20всех_20элементов_20с_20номером_20больше_20i_20нужно_20увеличить_20на_201_6',['i = -1, то элемент вставляется в конец, иначе вставляется на место под номером i. При этом номера всех элементов с номером больше i, нужно увеличить на 1.',['../class_kolibri_lib_1_1_u_i_1_1_menu.html#Если',1,'']]],
  ['то_20я_20вот_20вообще_20незнаю_20сколько_20размер_20стека_20сделать_7',['лучше std::thread, а не эту функцию, а то я вот вообще незнаю сколько размер стека сделать',['../namespace_kolibri_lib_1_1_thread.html#Используйте',1,'']]]
];
