var searchData=
[
  ['данных_20для_20точки_20используйте_20шаблоны_20например_3a_20point_20uint64_5ft_20p_0',['необходимо использовать конкретный теип данных для точки используйте шаблоны. Например: point&lt;uint64_t&gt; p;',['../struct_kolibri_lib_1_1point.html#Если',1,'']]],
  ['да_20да_20если_20детализация_204_20то_20круг_20это_20квадрат_1',['рисуется по detalization линий. Да-да если Детализация = 4, то круг это квадрат.',['../graphic_8hpp.html#Круг',1,'']]],
  ['да_20если_20детализация_204_20то_20круг_20это_20квадрат_2',['рисуется по detalization линий. Да-да если Детализация = 4, то круг это квадрат.',['../graphic_8hpp.html#Круг',1,'']]],
  ['деактивированном_20состоянии_20кнопка_20не_20нажимается_20а_20её_20link_20_5fid_20становится_20не_20действительным_3',['Деактивированном состоянии кнопка &quot;Не нажимается&quot;, а её @link _id становится не действительным',['../class_kolibri_lib_1_1_u_i_1_1buttons_1_1_button.html#В',1,'']]],
  ['действительно_20важно_20когда_20у_20вас_20объявленно_20более_202000_20кнопок_4',['функция может выполнятся очень долго, если вы уже создали довольно много кнопок. Это становится действительно важно когда у вас объявленно более 2000 кнопок',['../namespace_kolibri_lib_1_1_u_i_1_1buttons.html#Эта',1,'']]],
  ['действительным_5',['Деактивированном состоянии кнопка &quot;Не нажимается&quot;, а её @link _id становится не действительным',['../class_kolibri_lib_1_1_u_i_1_1buttons_1_1_button.html#В',1,'']]],
  ['детализация_204_20то_20круг_20это_20квадрат_6',['рисуется по detalization линий. Да-да если Детализация = 4, то круг это квадрат.',['../graphic_8hpp.html#Круг',1,'']]],
  ['для_20других_20классов_7',['как шиблон для других классов',['../class_kolibri_lib_1_1_u_i_1_1_u_i_element.html#Используется',1,'']]],
  ['для_20того_20чтобы_20функция_20render_20не_20пыталась_20создать_20кнопку_20так_20как_20в_20неактивном_20состоянии_20_5fid_20освобождается_20и_20его_20может_20занять_20другая_20кнопка_8',['необходимо для того чтобы функция render не пыталась создать кнопку, так как в неактивном состоянии #_id освобождается и его может занять другая кнопка',['../class_kolibri_lib_1_1_u_i_1_1buttons_1_1_button.html#Занчение',1,'']]],
  ['для_20точки_20используйте_20шаблоны_20например_3a_20point_20uint64_5ft_20p_9',['необходимо использовать конкретный теип данных для точки используйте шаблоны. Например: point&lt;uint64_t&gt; p;',['../struct_kolibri_lib_1_1point.html#Если',1,'']]],
  ['для_2016_10',['для 16,',['../struct_kolibri_lib_1_1_colors_1_1_a_r_g_b.html#uint16_t',1,'']]],
  ['для_208bit_11',[', для 8bit,',['../struct_kolibri_lib_1_1_colors_1_1_a_r_g_b.html#uint8_t',1,'']]],
  ['довольно_20много_20кнопок_20это_20становится_20действительно_20важно_20когда_20у_20вас_20объявленно_20более_202000_20кнопок_12',['функция может выполнятся очень долго, если вы уже создали довольно много кнопок. Это становится действительно важно когда у вас объявленно более 2000 кнопок',['../namespace_kolibri_lib_1_1_u_i_1_1buttons.html#Эта',1,'']]],
  ['долго_20если_20вы_20уже_20создали_20довольно_20много_20кнопок_20это_20становится_20действительно_20важно_20когда_20у_20вас_20объявленно_20более_202000_20кнопок_13',['функция может выполнятся очень долго, если вы уже создали довольно много кнопок. Это становится действительно важно когда у вас объявленно более 2000 кнопок',['../namespace_kolibri_lib_1_1_u_i_1_1buttons.html#Эта',1,'']]],
  ['должна_20быть_20вызвана_20функция_20endredraw_14',['после должна быть вызвана функция #EndRedraw()',['../class_kolibri_lib_1_1window_1_1_window.html#Обязательно',1,'']]],
  ['другая_20кнопка_15',['необходимо для того чтобы функция render не пыталась создать кнопку, так как в неактивном состоянии #_id освобождается и его может занять другая кнопка',['../class_kolibri_lib_1_1_u_i_1_1buttons_1_1_button.html#Занчение',1,'']]],
  ['других_20классов_16',['как шиблон для других классов',['../class_kolibri_lib_1_1_u_i_1_1_u_i_element.html#Используется',1,'']]]
];
