var searchData=
[
  ['так_20как_20в_20неактивном_20состоянии_20_5fid_20освобождается_20и_20его_20может_20занять_20другая_20кнопка_0',['необходимо для того чтобы функция render не пыталась создать кнопку, так как в неактивном состоянии #_id освобождается и его может занять другая кнопка',['../class_kolibri_lib_1_1_u_i_1_1buttons_1_1_button.html#Занчение',1,'']]],
  ['теип_20данных_20для_20точки_20используйте_20шаблоны_20например_3a_20point_20uint64_5ft_20p_1',['необходимо использовать конкретный теип данных для точки используйте шаблоны. Например: point&lt;uint64_t&gt; p;',['../struct_kolibri_lib_1_1point.html#Если',1,'']]],
  ['текстовая_20метка_20ничего_20особенного_2',['текстовая метка, ничего особенного.',['../class_kolibri_lib_1_1_u_i_1_1text_1_1_text_label.html#Простая',1,'']]],
  ['текст_20всегда_20отрисовывается_20в_20середине_20br_3',['важные сведения: текст всегда отрисовывается в середине  &lt;br&gt;',['../class_kolibri_lib_1_1_u_i_1_1text_1_1_text_label.html#Возможно',1,'']]],
  ['текущем_20потоке_4',['слот -1 то возвращается информация о текущем потоке',['../namespace_kolibri_lib_1_1_thread.html#если',1,'']]],
  ['того_20чтобы_20функция_20render_20не_20пыталась_20создать_20кнопку_20так_20как_20в_20неактивном_20состоянии_20_5fid_20освобождается_20и_20его_20может_20занять_20другая_20кнопка_5',['необходимо для того чтобы функция render не пыталась создать кнопку, так как в неактивном состоянии #_id освобождается и его может занять другая кнопка',['../class_kolibri_lib_1_1_u_i_1_1buttons_1_1_button.html#Занчение',1,'']]],
  ['точки_20используйте_20шаблоны_20например_3a_20point_20uint64_5ft_20p_6',['необходимо использовать конкретный теип данных для точки используйте шаблоны. Например: point&lt;uint64_t&gt; p;',['../struct_kolibri_lib_1_1point.html#Если',1,'']]],
  ['то_20возвращается_20информация_20о_20текущем_20потоке_7',['слот -1 то возвращается информация о текущем потоке',['../namespace_kolibri_lib_1_1_thread.html#если',1,'']]],
  ['то_20круг_20это_20квадрат_8',['рисуется по detalization линий. Да-да если Детализация = 4, то круг это квадрат.',['../graphic_8hpp.html#Круг',1,'']]]
];
