var searchData=
[
  ['изменяется_0',['растянуть/сжать выводимое изображение введя новые размеры в переменную size, само изображение при этом не изменяется',['../class_kolibri_lib_1_1_u_i_1_1_images_1_1_image.html#Можно',1,'']]],
  ['изменяет_20переменную_20link_20sys_5fcolor_5ftable_1',['изменяет переменную @link sys_color_table',['../namespace_kolibri_lib_1_1_o_s.html#Функция',1,'']]],
  ['изображение_20введя_20новые_20размеры_20в_20переменную_20size_20само_20изображение_20при_20этом_20не_20изменяется_2',['растянуть/сжать выводимое изображение введя новые размеры в переменную size, само изображение при этом не изменяется',['../class_kolibri_lib_1_1_u_i_1_1_images_1_1_image.html#Можно',1,'']]],
  ['из_20спика_20link_20char_3a_3atype_3',['значение из спика @link Char::Type',['../class_kolibri_lib_1_1_u_i_1_1text_1_1_char.html#Хранит',1,'']]],
  ['имена_20файлов_20это_20полные_20пути_4',['mv. Имена файлов - это полные пути',['../namespace_kolibri_lib_1_1filesystem.html#Аналог',1,'']]],
  ['имён_20этакий_20аналог_20стандартной_20библиотеки_20filesystem_20br_5',['пространство имён этакий аналог стандартной библиотеки &lt;filesystem&gt;  &lt;br&gt;',['../namespace_kolibri_lib_1_1filesystem.html#Это',1,'']]],
  ['иначе_20вставляется_20на_20место_20под_20номером_20i_20при_20этом_20номера_20всех_20элементов_20с_20номером_20больше_20i_20нужно_20увеличить_20на_201_6',['i = -1, то элемент вставляется в конец, иначе вставляется на место под номером i. При этом номера всех элементов с номером больше i, нужно увеличить на 1.',['../class_kolibri_lib_1_1_u_i_1_1_menu.html#Если',1,'']]],
  ['иначе_20false_7',['переменную @link _status в true если эта кнопка нажата, иначе false',['../class_kolibri_lib_1_1_u_i_1_1buttons_1_1_button.html#устанавливает',1,'']]],
  ['информация_20о_20текущем_20потоке_8',['слот -1 то возвращается информация о текущем потоке',['../namespace_kolibri_lib_1_1_thread.html#если',1,'']]],
  ['и_20его_20может_20занять_20другая_20кнопка_9',['необходимо для того чтобы функция render не пыталась создать кнопку, так как в неактивном состоянии #_id освобождается и его может занять другая кнопка',['../class_kolibri_lib_1_1_u_i_1_1buttons_1_1_button.html#Занчение',1,'']]]
];
