var searchData=
[
  ['левой_20кнопок_20мыши_0',[': EmulateMouse(EmulateMouse::LeftButton + EmulateMouse::RightButton) //Эмулирует нажатие правой и левой кнопок мыши',['../F:/KolibriOs/KolibriOS-Cpp-Lib/include/kolibriLib/input/mouse.hpp#Использование',1,'']]],
  ['линий_20да_20да_20если_20детализация_204_20то_20круг_20это_20квадрат_1',['рисуется по detalization линий. Да-да если Детализация = 4, то круг это квадрат.',['../graphic_8hpp.html#Круг',1,'']]],
  ['лишь_20жалкие_20пародии_20совподающие_20с_20настоящими_20лишь_20по_20размерам_20ширина_20высота_2',['самом деле это не настоящие шрифты, а лишь жалкие пародии, совподающие с настоящими лишь по размерам(ширина/высота)',['../namespace_kolibri_lib_1_1_u_i_1_1text_1_1_fonts.html#На',1,'']]],
  ['лучше_20std_3a_3athread_20а_20не_20эту_20функцию_20а_20то_20я_20вот_20вообще_20незнаю_20сколько_20размер_20стека_20сделать_3',['лучше std::thread, а не эту функцию, а то я вот вообще незнаю сколько размер стека сделать',['../namespace_kolibri_lib_1_1_thread.html#Используйте',1,'']]],
  ['любой_20обычный_20поток_20процесс_4',['завершить поток операционной системы OS/IDLE (номер слота 1), можно завершить любой обычный поток/процесс',['../namespace_kolibri_lib_1_1_thread.html#Нельзя',1,'']]]
];
