var searchData=
[
  ['элементов_20с_20номером_20больше_20i_20нужно_20увеличить_20на_201_0',['i = -1, то элемент вставляется в конец, иначе вставляется на место под номером i. При этом номера всех элементов с номером больше i, нужно увеличить на 1.',['../class_kolibri_lib_1_1_u_i_1_1_menu.html#Если',1,'']]],
  ['элементы_20br_1',['содержать другие элементы  &lt;br&gt;',['../class_kolibri_lib_1_1_u_i_1_1_frame.html#Может',1,'']]],
  ['элемент_20вставляется_20в_20конец_20иначе_20вставляется_20на_20место_20под_20номером_20i_20при_20этом_20номера_20всех_20элементов_20с_20номером_20больше_20i_20нужно_20увеличить_20на_201_2',['i = -1, то элемент вставляется в конец, иначе вставляется на место под номером i. При этом номера всех элементов с номером больше i, нужно увеличить на 1.',['../class_kolibri_lib_1_1_u_i_1_1_menu.html#Если',1,'']]],
  ['этакий_20аналог_20стандартной_20библиотеки_20filesystem_20br_3',['пространство имён этакий аналог стандартной библиотеки &lt;filesystem&gt;  &lt;br&gt;',['../namespace_kolibri_lib_1_1filesystem.html#Это',1,'']]],
  ['эта_20кнопка_20нажата_20иначе_20false_4',['переменную @link _status в true если эта кнопка нажата, иначе false',['../class_kolibri_lib_1_1_u_i_1_1buttons_1_1_button.html#устанавливает',1,'']]],
  ['этом_20не_20изменяется_5',['растянуть/сжать выводимое изображение введя новые размеры в переменную size, само изображение при этом не изменяется',['../class_kolibri_lib_1_1_u_i_1_1_images_1_1_image.html#Можно',1,'']]],
  ['этом_20номера_20всех_20элементов_20с_20номером_20больше_20i_20нужно_20увеличить_20на_201_6',['i = -1, то элемент вставляется в конец, иначе вставляется на место под номером i. При этом номера всех элементов с номером больше i, нужно увеличить на 1.',['../class_kolibri_lib_1_1_u_i_1_1_menu.html#Если',1,'']]],
  ['это_20всратая_20библиотека_7',['Это всратая библиотека',['../index.html',1,'']]],
  ['это_20квадрат_8',['рисуется по detalization линий. Да-да если Детализация = 4, то круг это квадрат.',['../graphic_8hpp.html#Круг',1,'']]],
  ['это_20полные_20пути_9',['mv. Имена файлов - это полные пути',['../namespace_kolibri_lib_1_1filesystem.html#Аналог',1,'']]],
  ['это_20становится_20действительно_20важно_20когда_20у_20вас_20объявленно_20более_202000_20кнопок_10',['функция может выполнятся очень долго, если вы уже создали довольно много кнопок. Это становится действительно важно когда у вас объявленно более 2000 кнопок',['../namespace_kolibri_lib_1_1_u_i_1_1buttons.html#Эта',1,'']]],
  ['эту_20функцию_20а_20то_20я_20вот_20вообще_20незнаю_20сколько_20размер_20стека_20сделать_11',['лучше std::thread, а не эту функцию, а то я вот вообще незнаю сколько размер стека сделать',['../namespace_kolibri_lib_1_1_thread.html#Используйте',1,'']]]
];
