var searchData=
[
  ['нарисованно_20в_20окне_0',['всё что было нарисованно в окне',['../namespace_kolibri_lib_1_1window.html#Стирает',1,'']]],
  ['начале_20программы_1',['в начале программы',['../namespace_kolibri_lib_1_1window.html#Вызывать',1,'']]],
  ['номер_20слота_201_20можно_20завершить_20любой_20обычный_20поток_20процесс_2',['завершить поток операционной системы OS/IDLE (номер слота 1), можно завершить любой обычный поток/процесс',['../namespace_kolibri_lib_1_1_thread.html#Нельзя',1,'']]]
];
