var searchData=
[
  ['1_20можно_20завершить_20любой_20обычный_20поток_20процесс_0',['завершить поток операционной системы OS/IDLE (номер слота 1), можно завершить любой обычный поток/процесс',['../namespace_kolibri_lib_1_1_thread.html#Нельзя',1,'']]],
  ['1_20то_20возвращается_20информация_20о_20текущем_20потоке_1',['слот -1 то возвращается информация о текущем потоке',['../namespace_kolibri_lib_1_1_thread.html#если',1,'']]],
  ['16_2',['для 16,',['../struct_kolibri_lib_1_1_colors_1_1_a_r_g_b.html#uint16_t',1,'']]]
];
