var searchData=
[
  ['эта_20кнопка_20нажата_20иначе_20false_0',['переменную @link _status в true если эта кнопка нажата, иначе false',['../class_kolibri_lib_1_1_u_i_1_1buttons_1_1_button.html#устанавливает',1,'']]],
  ['этом_20не_20изменяется_1',['растянуть/сжать выводимое изображение введя новые размеры в переменную size, само изображение при этом не изменяется',['../class_kolibri_lib_1_1_u_i_1_1_images_1_1image.html#Можно',1,'']]],
  ['это_20всратая_20библиотека_2',['Это всратая библиотека\',['../index.html',1,'']]],
  ['это_20становится_20действительно_20важно_20когда_20у_20вас_20объявленно_20более_202000_20кнопок_3',['функция может выполнятся очень долго, если вы уже создали довольно много кнопок. Это становится действительно важно когда у вас объявленно более 2000 кнопок',['../namespace_kolibri_lib_1_1_u_i_1_1buttons.html#Эта',1,'']]]
];
