var searchData=
[
  ['объявленно_20более_202000_20кнопок_0',['функция может выполнятся очень долго, если вы уже создали довольно много кнопок. Это становится действительно важно когда у вас объявленно более 2000 кнопок',['../_u_i_8hpp.html#Эта',1,'']]],
  ['обычный_20поток_20процесс_1',['завершить поток операционной системы OS/IDLE (номер слота 1), можно завершить любой обычный поток/процесс',['../namespace_kolibri_lib_1_1_thread.html#Нельзя',1,'']]],
  ['окне_2',['всё что было нарисованно в окне',['../namespace_kolibri_lib_1_1window.html#Стирает',1,'']]],
  ['операционной_20системы_20os_20idle_20номер_20слота_201_20можно_20завершить_20любой_20обычный_20поток_20процесс_3',['завершить поток операционной системы OS/IDLE (номер слота 1), можно завершить любой обычный поток/процесс',['../namespace_kolibri_lib_1_1_thread.html#Нельзя',1,'']]],
  ['очень_20долго_20если_20вы_20уже_20создали_20довольно_20много_20кнопок_20это_20становится_20действительно_20важно_20когда_20у_20вас_20объявленно_20более_202000_20кнопок_4',['функция может выполнятся очень долго, если вы уже создали довольно много кнопок. Это становится действительно важно когда у вас объявленно более 2000 кнопок',['../_u_i_8hpp.html#Эта',1,'']]]
];
