var searchData=
[
  ['после_20должна_20быть_20вызвана_20функция_20endredraw_0',['после должна быть вызвана функция #EndRedraw()',['../namespace_kolibri_lib_1_1window.html#Обязательно',1,'']]],
  ['поток_20операционной_20системы_20os_20idle_20номер_20слота_201_20можно_20завершить_20любой_20обычный_20поток_20процесс_1',['завершить поток операционной системы OS/IDLE (номер слота 1), можно завершить любой обычный поток/процесс',['../namespace_kolibri_lib_1_1_thread.html#Нельзя',1,'']]],
  ['программы_2',['в начале программы',['../namespace_kolibri_lib_1_1window.html#Вызывать',1,'']]],
  ['процесс_3',['завершить поток операционной системы OS/IDLE (номер слота 1), можно завершить любой обычный поток/процесс',['../namespace_kolibri_lib_1_1_thread.html#Нельзя',1,'']]]
];
