var searchData=
[
  ['более_202000_20кнопок_0',['функция может выполнятся очень долго, если вы уже создали довольно много кнопок. Это становится действительно важно когда у вас объявленно более 2000 кнопок',['../namespace_kolibri_lib_1_1_u_i_1_1buttons.html#Эта',1,'']]],
  ['было_20нарисованно_20в_20окне_1',['всё что было нарисованно в окне',['../class_kolibri_lib_1_1window_1_1_window.html#Стирает',1,'']]],
  ['быть_20вызвана_20функция_20endredraw_2',['после должна быть вызвана функция #EndRedraw()',['../class_kolibri_lib_1_1window_1_1_window.html#Обязательно',1,'']]],
  ['библиотека_3',['Это всратая библиотека\',['../index.html',1,'']]]
];
