var searchData=
[
  ['линий_20да_20да_20если_20детализация_204_20то_20круг_20это_20квадрат_0',['рисуется по detalization линий. Да-да если Детализация = 4, то круг это квадрат.',['../graphic_8hpp.html#Круг',1,'']]],
  ['лучше_20std_3a_3athread_20а_20не_20эту_20функцию_20а_20то_20я_20вот_20вообще_20незнаю_20сколько_20размер_20стека_20сделать_1',['лучше std::thread, а не эту функцию, а то я вот вообще незнаю сколько размер стека сделать',['../namespace_kolibri_lib_1_1_thread.html#Используйте',1,'']]],
  ['любой_20обычный_20поток_20процесс_2',['завершить поток операционной системы OS/IDLE (номер слота 1), можно завершить любой обычный поток/процесс',['../namespace_kolibri_lib_1_1_thread.html#Нельзя',1,'']]]
];
