var searchData=
[
  ['деактивированном_20состоянии_20кнопка_20не_20нажимается_20а_20её_20link_20_5fid_20становится_20не_20действительным_0',['Деактивированном состоянии кнопка &quot;Не нажимается&quot;, а её @link _id становится не действительным',['../class_kolibri_lib_1_1_u_i_1_1buttons_1_1_button.html#В',1,'']]],
  ['действительно_20важно_20когда_20у_20вас_20объявленно_20более_202000_20кнопок_1',['функция может выполнятся очень долго, если вы уже создали довольно много кнопок. Это становится действительно важно когда у вас объявленно более 2000 кнопок',['../_u_i_8hpp.html#Эта',1,'']]],
  ['действительным_2',['Деактивированном состоянии кнопка &quot;Не нажимается&quot;, а её @link _id становится не действительным',['../class_kolibri_lib_1_1_u_i_1_1buttons_1_1_button.html#В',1,'']]],
  ['для_20других_20классов_3',['как шиблон для других классов',['../class_kolibri_lib_1_1_u_i_1_1_u_i_element.html#Используется',1,'']]],
  ['для_20стека_20потока_20я_20не_20знаю_4',['нужно выделять памяти для стека потока? Я не знаю',['../namespace_kolibri_lib_1_1_thread.html#Сколько',1,'']]],
  ['для_20того_20чтобы_20функция_20render_20не_20пыталась_20создать_20кнопку_20так_20как_20в_20неактивном_20состоянии_20_5fid_20освобождается_20и_20его_20может_20занять_20другая_20кнопка_5',['необходимо для того чтобы функция render не пыталась создать кнопку, так как в неактивном состоянии #_id освобождается и его может занять другая кнопка',['../class_kolibri_lib_1_1_u_i_1_1buttons_1_1_button.html#Занчение',1,'']]],
  ['довольно_20много_20кнопок_20это_20становится_20действительно_20важно_20когда_20у_20вас_20объявленно_20более_202000_20кнопок_6',['функция может выполнятся очень долго, если вы уже создали довольно много кнопок. Это становится действительно важно когда у вас объявленно более 2000 кнопок',['../_u_i_8hpp.html#Эта',1,'']]],
  ['долго_20если_20вы_20уже_20создали_20довольно_20много_20кнопок_20это_20становится_20действительно_20важно_20когда_20у_20вас_20объявленно_20более_202000_20кнопок_7',['функция может выполнятся очень долго, если вы уже создали довольно много кнопок. Это становится действительно важно когда у вас объявленно более 2000 кнопок',['../_u_i_8hpp.html#Эта',1,'']]],
  ['должна_20быть_20вызвана_20функция_20endredraw_8',['после должна быть вызвана функция #EndRedraw()',['../class_kolibri_lib_1_1window_1_1_window.html#Обязательно',1,'']]],
  ['другая_20кнопка_9',['необходимо для того чтобы функция render не пыталась создать кнопку, так как в неактивном состоянии #_id освобождается и его может занять другая кнопка',['../class_kolibri_lib_1_1_u_i_1_1buttons_1_1_button.html#Занчение',1,'']]],
  ['других_20классов_10',['как шиблон для других классов',['../class_kolibri_lib_1_1_u_i_1_1_u_i_element.html#Используется',1,'']]]
];
