var searchData=
[
  ['мало_20языков_20поддерживается_0',['жаль что так мало языков поддерживается...',['../namespace_kolibri_lib_1_1_o_s.html#PS',1,'']]],
  ['метка_20ничего_20особенного_1',['текстовая метка, ничего особенного.',['../class_kolibri_lib_1_1_u_i_1_1text_1_1_text_label.html#Простая',1,'']]],
  ['много_20кнопок_20это_20становится_20действительно_20важно_20когда_20у_20вас_20объявленно_20более_202000_20кнопок_2',['функция может выполнятся очень долго, если вы уже создали довольно много кнопок. Это становится действительно важно когда у вас объявленно более 2000 кнопок',['../namespace_kolibri_lib_1_1_u_i_1_1buttons.html#Эта',1,'']]],
  ['может_20выполнятся_20очень_20долго_20если_20вы_20уже_20создали_20довольно_20много_20кнопок_20это_20становится_20действительно_20важно_20когда_20у_20вас_20объявленно_20более_202000_20кнопок_3',['функция может выполнятся очень долго, если вы уже создали довольно много кнопок. Это становится действительно важно когда у вас объявленно более 2000 кнопок',['../namespace_kolibri_lib_1_1_u_i_1_1buttons.html#Эта',1,'']]],
  ['может_20занять_20другая_20кнопка_4',['необходимо для того чтобы функция render не пыталась создать кнопку, так как в неактивном состоянии #_id освобождается и его может занять другая кнопка',['../class_kolibri_lib_1_1_u_i_1_1buttons_1_1_button.html#Занчение',1,'']]],
  ['может_20содержать_20как_20текст_20так_20и_20картинку_20например_20смайлик_5',['который может содержать как текст, так и картинку(например смайлик)',['../class_kolibri_lib_1_1_u_i_1_1text_1_1_char.html#Символ',1,'']]],
  ['можно_20завершить_20любой_20обычный_20поток_20процесс_6',['завершить поток операционной системы OS/IDLE (номер слота 1), можно завершить любой обычный поток/процесс',['../namespace_kolibri_lib_1_1_thread.html#Нельзя',1,'']]],
  ['мыши_7',[': EmulateMouse(EmulateMouse::LeftButton + EmulateMouse::RightButton) //Эмулирует нажатие правой и левой кнопок мыши',['../F:/KolibriOs/KolibriOS-Cpp-Lib/include/kolibriLib/input/mouse.hpp#Использование',1,'']]]
];
