var searchData=
[
  ['работала_0',['функцию нужно вызывать в цикле, чтобы кнопка работала',['../class_kolibri_lib_1_1_u_i_1_1buttons_1_1_button.html#Эту',1,'']]],
  ['работа_20с_20графикой_1',['Работа с графикой',['../md__c_1_2_users_2yyari_2_documents_2_kolibri_o_s_2_kolibri_o_s-_cpp-_lib_2include_2kolibri_lib_2graphic_2_readme.html',1,'']]],
  ['рабочее_20состояние_2',['функции @link Deactivate, возвращает кнопку в рабочее состояние',['../class_kolibri_lib_1_1_u_i_1_1buttons_1_1_button.html#Противоположна',1,'']]],
  ['размером_2032_2032_20пикселя_3',['курсора должен быть в формате .cur, стандартном для MS Windows, причём размером 32*32 пикселя',['../namespace_kolibri_lib_1_1mouse.html#Файл',1,'']]],
  ['размеры_20в_20переменную_20size_20само_20изображение_20при_20этом_20не_20изменяется_4',['растянуть/сжать выводимое изображение введя новые размеры в переменную size, само изображение при этом не изменяется',['../class_kolibri_lib_1_1_u_i_1_1_images_1_1_image.html#Можно',1,'']]],
  ['размер_20символов_20для_20всех_20символов_5',['размер символов для всех символов',['../class_kolibri_lib_1_1_u_i_1_1text_1_1_text.html#Изменяет',1,'']]],
  ['размер_20стека_20сделать_6',['лучше std::thread, а не эту функцию, а то я вот вообще незнаю сколько размер стека сделать',['../namespace_kolibri_lib_1_1_thread.html#Используйте',1,'']]],
  ['растянуть_20сжать_20выводимое_20изображение_20введя_20новые_20размеры_20в_20переменную_20size_20само_20изображение_20при_20этом_20не_20изменяется_7',['растянуть/сжать выводимое изображение введя новые размеры в переменную size, само изображение при этом не изменяется',['../class_kolibri_lib_1_1_u_i_1_1_images_1_1_image.html#Можно',1,'']]],
  ['рисуется_20по_20detalization_20линий_20да_20да_20если_20детализация_204_20то_20круг_20это_20квадрат_8',['рисуется по detalization линий. Да-да если Детализация = 4, то круг это квадрат.',['../graphic_8hpp.html#Круг',1,'']]]
];
