var searchData=
[
  ['уже_20создали_20довольно_20много_20кнопок_20это_20становится_20действительно_20важно_20когда_20у_20вас_20объявленно_20более_202000_20кнопок_0',['функция может выполнятся очень долго, если вы уже создали довольно много кнопок. Это становится действительно важно когда у вас объявленно более 2000 кнопок',['../namespace_kolibri_lib_1_1_u_i_1_1buttons.html#Эта',1,'']]],
  ['у_20вас_20объявленно_20более_202000_20кнопок_1',['функция может выполнятся очень долго, если вы уже создали довольно много кнопок. Это становится действительно важно когда у вас объявленно более 2000 кнопок',['../namespace_kolibri_lib_1_1_u_i_1_1buttons.html#Эта',1,'']]]
];
