var searchData=
[
  ['изменяется_0',['растянуть/сжать выводимое изображение введя новые размеры в переменную size, само изображение при этом не изменяется',['../class_kolibri_lib_1_1_u_i_1_1_images_1_1_image.html#Можно',1,'']]],
  ['изменяет_20переменную_20link_20sys_5fcolor_5ftable_1',['изменяет переменную @link sys_color_table',['../namespace_kolibri_lib_1_1_o_s.html#Функция',1,'']]],
  ['изображение_20введя_20новые_20размеры_20в_20переменную_20size_20само_20изображение_20при_20этом_20не_20изменяется_2',['растянуть/сжать выводимое изображение введя новые размеры в переменную size, само изображение при этом не изменяется',['../class_kolibri_lib_1_1_u_i_1_1_images_1_1_image.html#Можно',1,'']]],
  ['иначе_20false_3',['переменную @link _status в true если эта кнопка нажата, иначе false',['../class_kolibri_lib_1_1_u_i_1_1buttons_1_1_button.html#устанавливает',1,'']]],
  ['информация_20о_20текущем_20потоке_4',['слот -1 то возвращается информация о текущем потоке',['../namespace_kolibri_lib_1_1_thread.html#если',1,'']]],
  ['использовать_20конкретный_20теип_20данных_20для_20точки_20используйте_20шаблоны_20например_3a_20point_20uint64_5ft_20p_5',['необходимо использовать конкретный теип данных для точки используйте шаблоны. Например: point&lt;uint64_t&gt; p;',['../struct_kolibri_lib_1_1point.html#Если',1,'']]],
  ['используйте_20шаблоны_20например_3a_20point_20uint64_5ft_20p_6',['необходимо использовать конкретный теип данных для точки используйте шаблоны. Например: point&lt;uint64_t&gt; p;',['../struct_kolibri_lib_1_1point.html#Если',1,'']]],
  ['и_20его_20может_20занять_20другая_20кнопка_7',['необходимо для того чтобы функция render не пыталась создать кнопку, так как в неактивном состоянии #_id освобождается и его может занять другая кнопка',['../class_kolibri_lib_1_1_u_i_1_1buttons_1_1_button.html#Занчение',1,'']]]
];
