var searchData=
[
  ['экрана_0',['устанавливает курсор в середину экрана',['../namespace_kolibri_lib_1_1_u_i_1_1text.html#Функция',1,'']]],
  ['элементы_20br_1',['содержать другие элементы  &lt;br&gt;',['../class_kolibri_lib_1_1_u_i_1_1_frame.html#Может',1,'']]],
  ['эмулирует_20нажатие_20правой_20и_20левой_20кнопок_20мыши_2',[': EmulateMouse(EmulateMouse::LeftButton + EmulateMouse::RightButton) //Эмулирует нажатие правой и левой кнопок мыши',['../F:/KolibriOs/KolibriOS-Cpp-Lib/include/kolibriLib/input/mouse.hpp#Использование',1,'']]],
  ['этакий_20аналог_20стандартной_20библиотеки_20filesystem_20br_3',['пространство имён этакий аналог стандартной библиотеки &lt;filesystem&gt;  &lt;br&gt;',['../namespace_kolibri_lib_1_1filesystem.html#Это',1,'']]],
  ['эта_20кнопка_20нажата_20иначе_20false_4',['переменную @link _status в true если эта кнопка нажата, иначе false',['../class_kolibri_lib_1_1_u_i_1_1buttons_1_1_button.html#устанавливает',1,'']]],
  ['этом_20не_20изменяется_5',['растянуть/сжать выводимое изображение введя новые размеры в переменную size, само изображение при этом не изменяется',['../class_kolibri_lib_1_1_u_i_1_1_images_1_1_image.html#Можно',1,'']]],
  ['это_20квадрат_6',['рисуется по detalization линий. Да-да если Детализация = 4, то круг это квадрат.',['../graphic_8hpp.html#Круг',1,'']]],
  ['это_20не_20настоящие_20шрифты_20а_20лишь_20жалкие_20пародии_20совподающие_20с_20настоящими_20лишь_20по_20размерам_20ширина_20высота_7',['самом деле это не настоящие шрифты, а лишь жалкие пародии, совподающие с настоящими лишь по размерам(ширина/высота)',['../namespace_kolibri_lib_1_1_u_i_1_1text_1_1_fonts.html#На',1,'']]],
  ['это_20полные_20пути_8',['mv. Имена файлов - это полные пути',['../namespace_kolibri_lib_1_1filesystem.html#Аналог',1,'']]],
  ['это_20становится_20действительно_20важно_20когда_20у_20вас_20объявленно_20более_202000_20кнопок_9',['функция может выполнятся очень долго, если вы уже создали довольно много кнопок. Это становится действительно важно когда у вас объявленно более 2000 кнопок',['../namespace_kolibri_lib_1_1_u_i_1_1buttons.html#Эта',1,'']]],
  ['эту_20функцию_20а_20то_20я_20вот_20вообще_20незнаю_20сколько_20размер_20стека_20сделать_10',['лучше std::thread, а не эту функцию, а то я вот вообще незнаю сколько размер стека сделать',['../namespace_kolibri_lib_1_1_thread.html#Используйте',1,'']]]
];
