var searchData=
[
  ['как_20в_20неактивном_20состоянии_20_5fid_20освобождается_20и_20его_20может_20занять_20другая_20кнопка_0',['необходимо для того чтобы функция render не пыталась создать кнопку, так как в неактивном состоянии #_id освобождается и его может занять другая кнопка',['../class_kolibri_lib_1_1_u_i_1_1buttons_1_1_button.html#Занчение',1,'']]],
  ['как_20шиблон_20для_20других_20классов_1',['как шиблон для других классов',['../class_kolibri_lib_1_1_u_i_1_1_u_i_element.html#Используется',1,'']]],
  ['квадрат_2',['рисуется по detalization линий. Да-да если Детализация = 4, то круг это квадрат.',['../graphic_8hpp.html#Круг',1,'']]],
  ['классов_3',['как шиблон для других классов',['../class_kolibri_lib_1_1_u_i_1_1_u_i_element.html#Используется',1,'']]],
  ['кнопка_4',['необходимо для того чтобы функция render не пыталась создать кнопку, так как в неактивном состоянии #_id освобождается и его может занять другая кнопка',['../class_kolibri_lib_1_1_u_i_1_1buttons_1_1_button.html#Занчение',1,'']]],
  ['кнопка_20не_20нажимается_20а_20её_20link_20_5fid_20становится_20не_20действительным_5',['Деактивированном состоянии кнопка &quot;Не нажимается&quot;, а её @link _id становится не действительным',['../class_kolibri_lib_1_1_u_i_1_1buttons_1_1_button.html#В',1,'']]],
  ['кнопка_20нажата_20иначе_20false_6',['переменную @link _status в true если эта кнопка нажата, иначе false',['../class_kolibri_lib_1_1_u_i_1_1buttons_1_1_button.html#устанавливает',1,'']]],
  ['кнопка_20работала_7',['функцию нужно вызывать в цикле, чтобы кнопка работала',['../class_kolibri_lib_1_1_u_i_1_1buttons_1_1_button.html#Эту',1,'']]],
  ['кнопки_20выдаваемый_20системой_8',['кнопки выдаваемый системой',['../namespace_kolibri_lib_1_1_u_i_1_1buttons.html#id',1,'']]],
  ['кнопку_20в_20рабочее_20состояние_9',['функции @link Deactivate, возвращает кнопку в рабочее состояние',['../class_kolibri_lib_1_1_u_i_1_1buttons_1_1_button.html#Противоположна',1,'']]],
  ['кнопку_20так_20как_20в_20неактивном_20состоянии_20_5fid_20освобождается_20и_20его_20может_20занять_20другая_20кнопка_10',['необходимо для того чтобы функция render не пыталась создать кнопку, так как в неактивном состоянии #_id освобождается и его может занять другая кнопка',['../class_kolibri_lib_1_1_u_i_1_1buttons_1_1_button.html#Занчение',1,'']]],
  ['кнопок_20это_20становится_20действительно_20важно_20когда_20у_20вас_20объявленно_20более_202000_20кнопок_11',['функция может выполнятся очень долго, если вы уже создали довольно много кнопок. Это становится действительно важно когда у вас объявленно более 2000 кнопок',['../namespace_kolibri_lib_1_1_u_i_1_1buttons.html#Эта',1,'']]],
  ['кнопок_20мыши_12',[': EmulateMouse(EmulateMouse::LeftButton + EmulateMouse::RightButton) //Эмулирует нажатие правой и левой кнопок мыши',['../namespace_kolibri_lib_1_1mouse.html#Использование',1,'']]],
  ['когда_20у_20вас_20объявленно_20более_202000_20кнопок_13',['функция может выполнятся очень долго, если вы уже создали довольно много кнопок. Это становится действительно важно когда у вас объявленно более 2000 кнопок',['../namespace_kolibri_lib_1_1_u_i_1_1buttons.html#Эта',1,'']]],
  ['конец_20иначе_20вставляется_20на_20место_20под_20номером_20i_20при_20этом_20номера_20всех_20элементов_20с_20номером_20больше_20i_20нужно_20увеличить_20на_201_14',['i = -1, то элемент вставляется в конец, иначе вставляется на место под номером i. При этом номера всех элементов с номером больше i, нужно увеличить на 1.',['../struct_kolibri_lib_1_1point.html#Если',1,'']]],
  ['круг_20это_20квадрат_15',['рисуется по detalization линий. Да-да если Детализация = 4, то круг это квадрат.',['../graphic_8hpp.html#Круг',1,'']]],
  ['курсора_20должен_20быть_20в_20формате_20cur_20стандартном_20для_20ms_20windows_20причём_20размером_2032_2032_20пикселя_16',['курсора должен быть в формате .cur, стандартном для MS Windows, причём размером 32*32 пикселя',['../namespace_kolibri_lib_1_1mouse.html#Файл',1,'']]]
];
