var searchData=
[
  ['шаблоны_20например_3a_20point_20uint64_5ft_20p_0',['необходимо использовать конкретный теип данных для точки используйте шаблоны. Например: point&lt;uint64_t&gt; p;',['../struct_kolibri_lib_1_1point.html#Если',1,'']]],
  ['шиблон_20для_20других_20классов_1',['как шиблон для других классов',['../class_kolibri_lib_1_1_u_i_1_1_u_i_element.html#Используется',1,'']]],
  ['ширина_20высота_2',['самом деле это не настоящие шрифты, а лишь жалкие пародии, совподающие с настоящими лишь по размерам(ширина/высота)',['../namespace_kolibri_lib_1_1_u_i_1_1text_1_1_fonts.html#На',1,'']]],
  ['шрифта_20используйте_20link_20settextsize_20unsigned_3',['изменения высоты шрифта используйте @link SetTextSize(unsigned)',['../namespace_kolibri_lib_1_1_u_i_1_1text.html#Для',1,'']]],
  ['шрифты_20а_20лишь_20жалкие_20пародии_20совподающие_20с_20настоящими_20лишь_20по_20размерам_20ширина_20высота_4',['самом деле это не настоящие шрифты, а лишь жалкие пародии, совподающие с настоящими лишь по размерам(ширина/высота)',['../namespace_kolibri_lib_1_1_u_i_1_1text_1_1_fonts.html#На',1,'']]]
];
