var searchData=
[
  ['системой_0',['кнопки выдаваемый системой',['../_u_i_8hpp.html#id',1,'']]],
  ['системы_20os_20idle_20номер_20слота_201_20можно_20завершить_20любой_20обычный_20поток_20процесс_1',['завершить поток операционной системы OS/IDLE (номер слота 1), можно завершить любой обычный поток/процесс',['../namespace_kolibri_lib_1_1_thread.html#Нельзя',1,'']]],
  ['слота_201_20можно_20завершить_20любой_20обычный_20поток_20процесс_2',['завершить поток операционной системы OS/IDLE (номер слота 1), можно завершить любой обычный поток/процесс',['../namespace_kolibri_lib_1_1_thread.html#Нельзя',1,'']]],
  ['создали_20довольно_20много_20кнопок_20это_20становится_20действительно_20важно_20когда_20у_20вас_20объявленно_20более_202000_20кнопок_3',['функция может выполнятся очень долго, если вы уже создали довольно много кнопок. Это становится действительно важно когда у вас объявленно более 2000 кнопок',['../_u_i_8hpp.html#Эта',1,'']]],
  ['создать_20кнопку_20так_20как_20в_20неактивном_20состоянии_20_5fid_20освобождается_20и_20его_20может_20занять_20другая_20кнопка_4',['необходимо для того чтобы функция render не пыталась создать кнопку, так как в неактивном состоянии #_id освобождается и его может занять другая кнопка',['../class_kolibri_lib_1_1_u_i_1_1buttons_1_1_button.html#Занчение',1,'']]],
  ['состояние_20br_5',['функции @link Deactivate, возвращает кнопку в рабочее состояние  &lt;br&gt;',['../class_kolibri_lib_1_1_u_i_1_1buttons_1_1_button.html#Противоположна',1,'']]],
  ['состоянии_20кнопка_20не_20нажимается_20а_20её_20link_20_5fid_20становится_20не_20действительным_6',['Деактивированном состоянии кнопка &quot;Не нажимается&quot;, а её @link _id становится не действительным',['../class_kolibri_lib_1_1_u_i_1_1buttons_1_1_button.html#В',1,'']]],
  ['состоянии_20_5fid_20освобождается_20и_20его_20может_20занять_20другая_20кнопка_7',['необходимо для того чтобы функция render не пыталась создать кнопку, так как в неактивном состоянии #_id освобождается и его может занять другая кнопка',['../class_kolibri_lib_1_1_u_i_1_1buttons_1_1_button.html#Занчение',1,'']]],
  ['стандартной_20библиотеки_20filesystem_20br_8',['пространство имён этакий аналог стандартной библиотеки &lt;filesystem&gt;  &lt;br&gt;',['../namespace_kolibri_lib_1_1filesystem.html#Это',1,'']]],
  ['становится_20действительно_20важно_20когда_20у_20вас_20объявленно_20более_202000_20кнопок_9',['функция может выполнятся очень долго, если вы уже создали довольно много кнопок. Это становится действительно важно когда у вас объявленно более 2000 кнопок',['../_u_i_8hpp.html#Эта',1,'']]],
  ['становится_20не_20действительным_10',['Деактивированном состоянии кнопка &quot;Не нажимается&quot;, а её @link _id становится не действительным',['../class_kolibri_lib_1_1_u_i_1_1buttons_1_1_button.html#В',1,'']]],
  ['стека_20потока_20я_20не_20знаю_11',['нужно выделять памяти для стека потока? Я не знаю',['../namespace_kolibri_lib_1_1_thread.html#Сколько',1,'']]],
  ['с_20помошью_20линий_12',['рисуется с помошью линий',['../graphic_8hpp.html#Круг',1,'']]]
];
