var searchData=
[
  ['завершить_20поток_20операционной_20системы_20os_20idle_20номер_20слота_201_20можно_20завершить_20любой_20обычный_20поток_20процесс_0',['завершить поток операционной системы OS/IDLE (номер слота 1), можно завершить любой обычный поток/процесс',['../namespace_kolibri_lib_1_1_thread.html#Нельзя',1,'']]],
  ['занять_20другая_20кнопка_1',['необходимо для того чтобы функция render не пыталась создать кнопку, так как в неактивном состоянии #_id освобождается и его может занять другая кнопка',['../class_kolibri_lib_1_1_u_i_1_1buttons_1_1_button.html#Занчение',1,'']]],
  ['значение_20из_20спика_20link_20char_3a_3atype_2',['значение из спика @link Char::Type',['../class_kolibri_lib_1_1_u_i_1_1text_1_1_char.html#Хранит',1,'']]]
];
