var searchData=
[
  ['изменения_20высоты_20шрифта_20используйте_20link_20settextsize_20unsigned_0',['изменения высоты шрифта используйте @link SetTextSize(unsigned)',['../namespace_kolibri_lib_1_1_u_i_1_1text.html#Для',1,'']]],
  ['изменяется_1',['растянуть/сжать выводимое изображение введя новые размеры в переменную size, само изображение при этом не изменяется',['../class_kolibri_lib_1_1_u_i_1_1_images_1_1_image.html#Можно',1,'']]],
  ['изображение_20введя_20новые_20размеры_20в_20переменную_20size_20само_20изображение_20при_20этом_20не_20изменяется_2',['растянуть/сжать выводимое изображение введя новые размеры в переменную size, само изображение при этом не изменяется',['../class_kolibri_lib_1_1_u_i_1_1_images_1_1_image.html#Можно',1,'']]],
  ['из_20спика_20link_20char_3a_3atype_3',['значение из спика @link Char::Type',['../class_kolibri_lib_1_1_u_i_1_1text_1_1_char.html#Хранит',1,'']]],
  ['имена_20файлов_20это_20полные_20пути_4',['mv. Имена файлов - это полные пути',['../namespace_kolibri_lib_1_1filesystem.html#Аналог',1,'']]],
  ['имён_20этакий_20аналог_20стандартной_20библиотеки_20filesystem_20br_5',['пространство имён этакий аналог стандартной библиотеки &lt;filesystem&gt;  &lt;br&gt;',['../namespace_kolibri_lib_1_1filesystem.html#Это',1,'']]],
  ['иначе_20false_6',['переменную @link _status в true если эта кнопка нажата, иначе false',['../class_kolibri_lib_1_1_u_i_1_1buttons_1_1_button.html#устанавливает',1,'']]],
  ['информация_20о_20текущем_20потоке_7',['слот -1 то возвращается информация о текущем потоке',['../namespace_kolibri_lib_1_1_thread.html#если',1,'']]],
  ['использовать_20конкретный_20теип_20данных_20для_20точки_20используйте_20шаблоны_20например_3a_20point_20uint64_5ft_20p_8',['необходимо использовать конкретный теип данных для точки используйте шаблоны. Например: point&lt;uint64_t&gt; p;',['../struct_kolibri_lib_1_1point.html#Если',1,'']]],
  ['используйте_20шаблоны_20например_3a_20point_20uint64_5ft_20p_9',['необходимо использовать конкретный теип данных для точки используйте шаблоны. Например: point&lt;uint64_t&gt; p;',['../struct_kolibri_lib_1_1point.html#Если',1,'']]],
  ['используйте_20link_20settextsize_20unsigned_10',['изменения высоты шрифта используйте @link SetTextSize(unsigned)',['../namespace_kolibri_lib_1_1_u_i_1_1text.html#Для',1,'']]],
  ['и_20его_20может_20занять_20другая_20кнопка_11',['необходимо для того чтобы функция render не пыталась создать кнопку, так как в неактивном состоянии #_id освобождается и его может занять другая кнопка',['../class_kolibri_lib_1_1_u_i_1_1buttons_1_1_button.html#Занчение',1,'']]],
  ['и_20картинку_20например_20смайлик_12',['который может содержать как текст, так и картинку(например смайлик)',['../class_kolibri_lib_1_1_u_i_1_1text_1_1_char.html#Символ',1,'']]],
  ['и_20левой_20кнопок_20мыши_13',[': EmulateMouse(EmulateMouse::LeftButton + EmulateMouse::RightButton) //Эмулирует нажатие правой и левой кнопок мыши',['../F:/KolibriOs/KolibriOS-Cpp-Lib/include/kolibriLib/input/mouse.hpp#Использование',1,'']]]
];
