var searchData=
[
  ['левой_20кнопок_20мыши_0',[': EmulateMouse(EmulateMouse::LeftButton + EmulateMouse::RightButton) //Эмулирует нажатие правой и левой кнопок мыши',['../namespace_kolibri_lib_1_1mouse.html#Использование',1,'']]],
  ['линий_20да_20да_20если_20детализация_204_20то_20круг_20это_20квадрат_1',['рисуется по detalization линий. Да-да если Детализация = 4, то круг это квадрат.',['../graphic_8hpp.html#Круг',1,'']]],
  ['любой_20обычный_20поток_20процесс_2',['завершить поток операционной системы OS/IDLE (номер слота 1), можно завершить любой обычный поток/процесс',['../namespace_kolibri_lib_1_1_thread.html#Нельзя',1,'']]]
];
