var searchData=
[
  ['этакий_20аналог_20стандартной_20библиотеки_20filesystem_20br_0',['пространство имён этакий аналог стандартной библиотеки &lt;filesystem&gt;  &lt;br&gt;',['../namespace_kolibri_lib_1_1filesystem.html#Это',1,'']]],
  ['эта_20кнопка_20нажата_20иначе_20false_1',['переменную @link _status в true если эта кнопка нажата, иначе false',['../class_kolibri_lib_1_1_u_i_1_1buttons_1_1_empety_button.html#устанавливает',1,'']]],
  ['это_20становится_20действительно_20важно_20когда_20у_20вас_20объявленно_20более_202000_20кнопок_2',['функция может выполнятся очень долго, если вы уже создали довольно много кнопок. Это становится действительно важно когда у вас объявленно более 2000 кнопок',['../namespace_kolibri_lib_1_1_u_i_1_1buttons.html#Эта',1,'']]]
];
