var searchData=
[
  ['более_202000_20кнопок_0',['функция может выполнятся очень долго, если вы уже создали довольно много кнопок. Это становится действительно важно когда у вас объявленно более 2000 кнопок',['../_u_i_8hpp.html#Эта',1,'']]],
  ['было_20нарисованно_20в_20окне_1',['всё что было нарисованно в окне',['../namespace_kolibri_lib_1_1window.html#Стирает',1,'']]],
  ['быть_20вызвана_20функция_20endredraw_2',['после должна быть вызвана функция #EndRedraw()',['../namespace_kolibri_lib_1_1window.html#Обязательно',1,'']]]
];
