var searchData=
[
  ['1_20можно_20завершить_20любой_20обычный_20поток_20процесс_0',['завершить поток операционной системы OS/IDLE (номер слота 1), можно завершить любой обычный поток/процесс',['../namespace_kolibri_lib_1_1_thread.html#Нельзя',1,'']]],
  ['1_20то_20возвращается_20информация_20о_20текущем_20потоке_1',['слот -1 то возвращается информация о текущем потоке',['../namespace_kolibri_lib_1_1_thread.html#если',1,'']]],
  ['1_20то_20элемент_20вставляется_20в_20конец_20иначе_20вставляется_20на_20место_20под_20номером_20i_20при_20этом_20номера_20всех_20элементов_20с_20номером_20больше_20i_20нужно_20увеличить_20на_201_2',['i = -1, то элемент вставляется в конец, иначе вставляется на место под номером i. При этом номера всех элементов с номером больше i, нужно увеличить на 1.',['../class_kolibri_lib_1_1_u_i_1_1_menu.html#Если',1,'']]]
];
