var searchData=
[
  ['чекбокс_20ему_20можно_20задать_20различные_20стили_0',['просто чекбокс, ему можно задать различные стили',['../namespace_kolibri_lib_1_1filesystem.html#Это',1,'']]],
  ['чтобы_20кнопка_20работала_1',['функцию нужно вызывать в цикле, чтобы кнопка работала',['../class_kolibri_lib_1_1_u_i_1_1buttons_1_1_button.html#Эту',1,'']]],
  ['чтобы_20функция_20render_20не_20пыталась_20создать_20кнопку_20так_20как_20в_20неактивном_20состоянии_20_5fid_20освобождается_20и_20его_20может_20занять_20другая_20кнопка_2',['необходимо для того чтобы функция render не пыталась создать кнопку, так как в неактивном состоянии #_id освобождается и его может занять другая кнопка',['../class_kolibri_lib_1_1_u_i_1_1buttons_1_1_button.html#Занчение',1,'']]],
  ['что_20было_20нарисованно_20в_20окне_3',['всё что было нарисованно в окне',['../class_kolibri_lib_1_1window_1_1_window.html#Стирает',1,'']]]
];
