var searchData=
[
  ['системы_20os_20idle_20номер_20слота_201_20можно_20завершить_20любой_20обычный_20поток_20процесс_0',['завершить поток операционной системы OS/IDLE (номер слота 1), можно завершить любой обычный поток/процесс',['../namespace_kolibri_lib_1_1_thread.html#Нельзя',1,'']]],
  ['слота_201_20можно_20завершить_20любой_20обычный_20поток_20процесс_1',['завершить поток операционной системы OS/IDLE (номер слота 1), можно завершить любой обычный поток/процесс',['../namespace_kolibri_lib_1_1_thread.html#Нельзя',1,'']]]
];
