var searchData=
[
  ['как_20в_20неактивном_20состоянии_20_5fid_20освобождается_20и_20его_20может_20занять_20другая_20кнопка_0',['необходимо для того чтобы функция render не пыталась создать кнопку, так как в неактивном состоянии #_id освобождается и его может занять другая кнопка',['../class_kolibri_lib_1_1_u_i_1_1buttons_1_1_button.html#Занчение',1,'']]],
  ['как_20шиблон_20для_20других_20классов_1',['как шиблон для других классов',['../class_kolibri_lib_1_1_u_i_1_1_u_i_element.html#Используется',1,'']]],
  ['классов_2',['как шиблон для других классов',['../class_kolibri_lib_1_1_u_i_1_1_u_i_element.html#Используется',1,'']]],
  ['кнопка_3',['необходимо для того чтобы функция render не пыталась создать кнопку, так как в неактивном состоянии #_id освобождается и его может занять другая кнопка',['../class_kolibri_lib_1_1_u_i_1_1buttons_1_1_button.html#Занчение',1,'']]],
  ['кнопка_20не_20нажимается_20а_20её_20link_20_5fid_20становится_20не_20действительным_4',['Деактивированном состоянии кнопка &quot;Не нажимается&quot;, а её @link _id становится не действительным',['../class_kolibri_lib_1_1_u_i_1_1buttons_1_1_button.html#В',1,'']]],
  ['кнопка_20нажата_20иначе_20false_5',['переменную #_status в true если эта кнопка нажата, иначе false',['../class_kolibri_lib_1_1_u_i_1_1buttons_1_1_button.html#устанавливает',1,'']]],
  ['кнопки_20выдаваемый_20системой_6',['кнопки выдаваемый системой',['../_u_i_8hpp.html#id',1,'']]],
  ['кнопку_20в_20рабочее_20состояние_20br_7',['функции @link Deactivate, возвращает кнопку в рабочее состояние  &lt;br&gt;',['../class_kolibri_lib_1_1_u_i_1_1buttons_1_1_button.html#Противоположна',1,'']]],
  ['кнопку_20так_20как_20в_20неактивном_20состоянии_20_5fid_20освобождается_20и_20его_20может_20занять_20другая_20кнопка_8',['необходимо для того чтобы функция render не пыталась создать кнопку, так как в неактивном состоянии #_id освобождается и его может занять другая кнопка',['../class_kolibri_lib_1_1_u_i_1_1buttons_1_1_button.html#Занчение',1,'']]],
  ['кнопок_20это_20становится_20действительно_20важно_20когда_20у_20вас_20объявленно_20более_202000_20кнопок_9',['функция может выполнятся очень долго, если вы уже создали довольно много кнопок. Это становится действительно важно когда у вас объявленно более 2000 кнопок',['../_u_i_8hpp.html#Эта',1,'']]],
  ['когда_20у_20вас_20объявленно_20более_202000_20кнопок_10',['функция может выполнятся очень долго, если вы уже создали довольно много кнопок. Это становится действительно важно когда у вас объявленно более 2000 кнопок',['../_u_i_8hpp.html#Эта',1,'']]]
];
