var searchData=
[
  ['объявленно_20более_202000_20кнопок_0',['функция может выполнятся очень долго, если вы уже создали довольно много кнопок. Это становится действительно важно когда у вас объявленно более 2000 кнопок',['../namespace_kolibri_lib_1_1_u_i_1_1buttons.html#Эта',1,'']]],
  ['обычный_20поток_20процесс_1',['завершить поток операционной системы OS/IDLE (номер слота 1), можно завершить любой обычный поток/процесс',['../namespace_kolibri_lib_1_1_thread.html#Нельзя',1,'']]],
  ['ов_2',['std::vector @link Char ов',['../class_kolibri_lib_1_1_u_i_1_1text_1_1_text.html#Фактически',1,'']]],
  ['окне_3',['всё что было нарисованно в окне',['../class_kolibri_lib_1_1window_1_1_window.html#Стирает',1,'']]],
  ['окно_20остаётся_20привязаным_20к_20потоку_20в_20которм_20бы_20вызван_20конструктор_4',['простому: Окно остаётся привязаным к потоку, в которм бы вызван конструктор',['../class_kolibri_lib_1_1window_1_1_window.html#По',1,'']]],
  ['операционной_20системы_20os_20idle_20номер_20слота_201_20можно_20завершить_20любой_20обычный_20поток_20процесс_5',['завершить поток операционной системы OS/IDLE (номер слота 1), можно завершить любой обычный поток/процесс',['../namespace_kolibri_lib_1_1_thread.html#Нельзя',1,'']]],
  ['освобождается_20и_20его_20может_20занять_20другая_20кнопка_6',['необходимо для того чтобы функция render не пыталась создать кнопку, так как в неактивном состоянии #_id освобождается и его может занять другая кнопка',['../class_kolibri_lib_1_1_u_i_1_1buttons_1_1_button.html#Занчение',1,'']]],
  ['особенного_7',['текстовая метка, ничего особенного.',['../class_kolibri_lib_1_1_u_i_1_1text_1_1_text_label.html#Простая',1,'']]],
  ['остаётся_20привязаным_20к_20потоку_20в_20которм_20бы_20вызван_20конструктор_8',['простому: Окно остаётся привязаным к потоку, в которм бы вызван конструктор',['../class_kolibri_lib_1_1window_1_1_window.html#По',1,'']]],
  ['отрисовывается_20в_20середине_20br_9',['важные сведения: текст всегда отрисовывается в середине  &lt;br&gt;',['../class_kolibri_lib_1_1_u_i_1_1text_1_1_text_label.html#Возможно',1,'']]],
  ['очень_20долго_20если_20вы_20уже_20создали_20довольно_20много_20кнопок_20это_20становится_20действительно_20важно_20когда_20у_20вас_20объявленно_20более_202000_20кнопок_10',['функция может выполнятся очень долго, если вы уже создали довольно много кнопок. Это становится действительно важно когда у вас объявленно более 2000 кнопок',['../namespace_kolibri_lib_1_1_u_i_1_1buttons.html#Эта',1,'']]],
  ['о_20текущем_20потоке_11',['слот -1 то возвращается информация о текущем потоке',['../namespace_kolibri_lib_1_1_thread.html#если',1,'']]]
];
