var searchData=
[
  ['работала_0',['функцию нужно вызывать в цикле, чтобы кнопка работала',['../class_kolibri_lib_1_1_u_i_1_1buttons_1_1_button.html#Эту',1,'']]],
  ['рабочее_20состояние_1',['функции @link Deactivate, возвращает кнопку в рабочее состояние',['../class_kolibri_lib_1_1_u_i_1_1buttons_1_1_button.html#Противоположна',1,'']]],
  ['различные_20стили_2',['просто чекбокс, ему можно задать различные стили',['../namespace_kolibri_lib_1_1filesystem.html#Это',1,'']]],
  ['размеры_20в_20переменную_20size_20само_20изображение_20при_20этом_20не_20изменяется_3',['растянуть/сжать выводимое изображение введя новые размеры в переменную size, само изображение при этом не изменяется',['../class_kolibri_lib_1_1_u_i_1_1_images_1_1_image.html#Можно',1,'']]],
  ['растянуть_20сжать_20выводимое_20изображение_20введя_20новые_20размеры_20в_20переменную_20size_20само_20изображение_20при_20этом_20не_20изменяется_4',['растянуть/сжать выводимое изображение введя новые размеры в переменную size, само изображение при этом не изменяется',['../class_kolibri_lib_1_1_u_i_1_1_images_1_1_image.html#Можно',1,'']]],
  ['рисуется_20по_20detalization_20линий_20да_20да_20если_20детализация_204_20то_20круг_20это_20квадрат_5',['рисуется по detalization линий. Да-да если Детализация = 4, то круг это квадрат.',['../graphic_8hpp.html#Круг',1,'']]]
];
