var searchData=
[
  ['изменяет_20переменную_20link_20sys_5fcolor_5ftable_0',['изменяет переменную @link sys_color_table',['../namespace_kolibri_lib_1_1_o_s.html#Функция',1,'']]],
  ['имён_20этакий_20аналог_20стандартной_20библиотеки_20filesystem_20br_1',['пространство имён этакий аналог стандартной библиотеки &lt;filesystem&gt;  &lt;br&gt;',['../namespace_kolibri_lib_1_1filesystem.html#Это',1,'']]],
  ['иначе_20false_2',['переменную #_status в true если эта кнопка нажата, иначе false',['../class_kolibri_lib_1_1_u_i_1_1buttons_1_1_button.html#устанавливает',1,'']]],
  ['и_20вызывай_20в_20начале_20программы_3',['не заморачиваяся, и вызывай в начале программы',['../namespace_kolibri_lib.html#Просто',1,'']]],
  ['и_20его_20может_20занять_20другая_20кнопка_4',['необходимо для того чтобы функция render не пыталась создать кнопку, так как в неактивном состоянии #_id освобождается и его может занять другая кнопка',['../class_kolibri_lib_1_1_u_i_1_1buttons_1_1_button.html#Занчение',1,'']]]
];
