var searchData=
[
  ['важно_20когда_20у_20вас_20объявленно_20более_202000_20кнопок_0',['функция может выполнятся очень долго, если вы уже создали довольно много кнопок. Это становится действительно важно когда у вас объявленно более 2000 кнопок',['../_u_i_8hpp.html#Эта',1,'']]],
  ['вас_20объявленно_20более_202000_20кнопок_1',['функция может выполнятся очень долго, если вы уже создали довольно много кнопок. Это становится действительно важно когда у вас объявленно более 2000 кнопок',['../_u_i_8hpp.html#Эта',1,'']]],
  ['всё_20что_20было_20нарисованно_20в_20окне_2',['всё что было нарисованно в окне',['../namespace_kolibri_lib_1_1window.html#Стирает',1,'']]],
  ['вызвана_20функция_20endredraw_3',['после должна быть вызвана функция #EndRedraw()',['../namespace_kolibri_lib_1_1window.html#Обязательно',1,'']]],
  ['выполнятся_20очень_20долго_20если_20вы_20уже_20создали_20довольно_20много_20кнопок_20это_20становится_20действительно_20важно_20когда_20у_20вас_20объявленно_20более_202000_20кнопок_4',['функция может выполнятся очень долго, если вы уже создали довольно много кнопок. Это становится действительно важно когда у вас объявленно более 2000 кнопок',['../_u_i_8hpp.html#Эта',1,'']]],
  ['вы_20уже_20создали_20довольно_20много_20кнопок_20это_20становится_20действительно_20важно_20когда_20у_20вас_20объявленно_20более_202000_20кнопок_5',['функция может выполнятся очень долго, если вы уже создали довольно много кнопок. Это становится действительно важно когда у вас объявленно более 2000 кнопок',['../_u_i_8hpp.html#Эта',1,'']]],
  ['в_20начале_20программы_6',['в начале программы',['../namespace_kolibri_lib_1_1window.html#Вызывать',1,'']]],
  ['в_20окне_7',['всё что было нарисованно в окне',['../namespace_kolibri_lib_1_1window.html#Стирает',1,'']]]
];
