var searchData=
[
  ['так_20как_20в_20неактивном_20состоянии_20_5fid_20освобождается_20и_20его_20может_20занять_20другая_20кнопка_0',['необходимо для того чтобы функция render не пыталась создать кнопку, так как в неактивном состоянии #_id освобождается и его может занять другая кнопка',['../class_kolibri_lib_1_1_u_i_1_1buttons_1_1_button.html#Занчение',1,'']]],
  ['текстовая_20метка_20ничего_20особенного_1',['текстовая метка, ничего особенного.',['../class_kolibri_lib_1_1_u_i_1_1text_1_1_text_label.html#Простая',1,'']]],
  ['текст_20всегда_20отрисовывается_20в_20середине_20br_2',['важные сведения: текст всегда отрисовывается в середине  &lt;br&gt;',['../class_kolibri_lib_1_1_u_i_1_1text_1_1_text_label.html#Возможно',1,'']]],
  ['текущем_20потоке_3',['слот -1 то возвращается информация о текущем потоке',['../namespace_kolibri_lib_1_1_thread.html#если',1,'']]],
  ['того_20чтобы_20функция_20render_20не_20пыталась_20создать_20кнопку_20так_20как_20в_20неактивном_20состоянии_20_5fid_20освобождается_20и_20его_20может_20занять_20другая_20кнопка_4',['необходимо для того чтобы функция render не пыталась создать кнопку, так как в неактивном состоянии #_id освобождается и его может занять другая кнопка',['../class_kolibri_lib_1_1_u_i_1_1buttons_1_1_button.html#Занчение',1,'']]],
  ['то_20возвращается_20информация_20о_20текущем_20потоке_5',['слот -1 то возвращается информация о текущем потоке',['../namespace_kolibri_lib_1_1_thread.html#если',1,'']]],
  ['то_20круг_20это_20квадрат_6',['рисуется по detalization линий. Да-да если Детализация = 4, то круг это квадрат.',['../graphic_8hpp.html#Круг',1,'']]],
  ['то_20элемент_20вставляется_20в_20конец_20иначе_20вставляется_20на_20место_20под_20номером_20i_20при_20этом_20номера_20всех_20элементов_20с_20номером_20больше_20i_20нужно_20увеличить_20на_201_7',['i = -1, то элемент вставляется в конец, иначе вставляется на место под номером i. При этом номера всех элементов с номером больше i, нужно увеличить на 1.',['../struct_kolibri_lib_1_1point.html#Если',1,'']]]
];
