var searchData=
[
  ['более_202000_20кнопок_0',['функция может выполнятся очень долго, если вы уже создали довольно много кнопок. Это становится действительно важно когда у вас объявленно более 2000 кнопок',['../namespace_kolibri_lib_1_1_u_i_1_1buttons.html#Эта',1,'']]],
  ['больше_20i_20нужно_20увеличить_20на_201_1',['i = -1, то элемент вставляется в конец, иначе вставляется на место под номером i. При этом номера всех элементов с номером больше i, нужно увеличить на 1.',['../struct_kolibri_lib_1_1point.html#Если',1,'']]],
  ['было_20нарисованно_20в_20окне_2',['всё что было нарисованно в окне',['../class_kolibri_lib_1_1window_1_1_window.html#Стирает',1,'']]],
  ['быть_20вызвана_20функция_20endredraw_3',['после должна быть вызвана функция #EndRedraw()',['../class_kolibri_lib_1_1window_1_1_window.html#Обязательно',1,'']]],
  ['быть_20в_20формате_20cur_20стандартном_20для_20ms_20windows_20причём_20размером_2032_2032_20пикселя_4',['курсора должен быть в формате .cur, стандартном для MS Windows, причём размером 32*32 пикселя',['../namespace_kolibri_lib_1_1mouse.html#Файл',1,'']]],
  ['библиотека_5',['Это всратая библиотека',['../index.html',1,'']]]
];
