var searchData=
[
  ['так_20как_20в_20неактивном_20состоянии_20_5fid_20освобождается_20и_20его_20может_20занять_20другая_20кнопка_0',['необходимо для того чтобы функция render не пыталась создать кнопку, так как в неактивном состоянии #_id освобождается и его может занять другая кнопка',['../class_kolibri_lib_1_1_u_i_1_1buttons_1_1_button.html#Занчение',1,'']]],
  ['теип_20данных_20для_20точки_20используйте_20шаблоны_20например_3a_20point_20uint64_5ft_20p_1',['необходимо использовать конкретный теип данных для точки используйте шаблоны. Например: point&lt;uint64_t&gt; p;',['../struct_kolibri_lib_1_1point.html#Если',1,'']]],
  ['того_20чтобы_20функция_20render_20не_20пыталась_20создать_20кнопку_20так_20как_20в_20неактивном_20состоянии_20_5fid_20освобождается_20и_20его_20может_20занять_20другая_20кнопка_2',['необходимо для того чтобы функция render не пыталась создать кнопку, так как в неактивном состоянии #_id освобождается и его может занять другая кнопка',['../class_kolibri_lib_1_1_u_i_1_1buttons_1_1_button.html#Занчение',1,'']]],
  ['точки_20используйте_20шаблоны_20например_3a_20point_20uint64_5ft_20p_3',['необходимо использовать конкретный теип данных для точки используйте шаблоны. Например: point&lt;uint64_t&gt; p;',['../struct_kolibri_lib_1_1point.html#Если',1,'']]]
];
